package com.amaranth10.cr.cra.cra1000.mapper;

import com.amaranth10.cr.cra.cra1000.model.CRA1000Model;
import com.amaranth10.cr.cra.cra1000.model.Patient;
import org.apache.ibatis.annotations.Mapper;
import java.util.List;

/**
 * 진료 메인 Mapper
 */
@Mapper
public interface CRA1000Mapper {
    /** 조회 TEST */
    List<CRA1000Model> testData ();

    /** CLRS0101 환자현황 ========================================================================================================================================== */
    /** 환자현황 대기 환자수 조회 -------------------------------------------------------------------------------------------------------------------------------------- */
    Object patientCount (Object param);

    /** 환자현황 대기 리스트 ------------------------------------------------------------------------------------------------------------------------------------------ */
    List<Patient> patientList (Object param) ;
    /** ========================================================================================================================================================== */
}
